// 7-63 分两列 (5分)
//一列纵队在上课的时候会造成很大的麻烦，体育老师常用的办法就是让同学们1、2报数，然后报2的同学向后退一步。现在我们已经知道一列纵队时候同学的学号分布，那么你能输出分成两列后同学的学号么?

//输入格式:
//第一行包括一个数n，表示班级里有n位学生，班级人数至少是1，不超过100。第二行包括n个数，表示一列纵队时每个同学的学号。

//输出格式:
//请按顺序输出分开两列后两列每位同学的学号，用空格隔开。每列同学占两行，报1的同学在第1行。

//输入样例:
//5
//2 1 3 5 4

//输出样例:
//2 3 4
//1 5

#include <stdio.h>

int main()
{
	int n;
	scanf("%d", &n);
	int stu[n];
	for (int i = 0; i < n; i++)
	{
		scanf("%d", &stu[i]);
	}
	printf("%d", stu[0]);
	for (int i = 2; i < n; i = i + 2)printf(" %d", stu[i]);
    printf("\n");
	if (n > 1) {
		printf("%d", stu[1]);
		for (int i = 3; i < n; i = i + 2)printf(" %d", stu[i]);
	}
    printf("\n");
}