// 7-65 评委打分 (5分)
//班级里要搞智力竞赛啦!同学们都踊跃参加。进入最后决赛的是10个同学，随着一道道题目的出示，有时是1号选手得分，有时是5号选手得分，每次答对者得10分，最后结果如何呢?

//输入格式:
//第一行有十个整数，表示十位同学的初始分。第二行一个整数n，表示有n道题竞赛。 接下去有n行，每行有一个数字x，x表示本次可以加分的选手序号（每次答对者得10分）。

//输出格式:
//10个同学最终的得分值，每两位同学之间有一个空格。

//输入样例:
//10 0 0 0 10 10 0 0 0 10
//3
//1
//10
//1

//输出样例:
//30 0 0 0 10 10 0 0 0 20

#include <stdio.h>

int main() {
    int score[10];
	for (int i = 0; i < 10; i++)
	{
		scanf("%d", &score[i]);
	}
	int n;
	scanf("%d", &n);
	for (int i = 0; i < n; i++)
	{
		int j;
		scanf("%d", &j);
		score[j - 1] += 10;
	}
	printf("%d", score[0]);
	for (int i = 1; i < 10; i++)
	{
		printf(" %d", score[i]);
	}
    return 0;
}
