// 7-91 输出闰年 (15分)
//输出21世纪中截止某个年份以来的所有闰年年份。注意：闰年的判别条件是该年年份能被4整除但不能被100整除、或者能被400整除。

//输入格式:
//输入在一行中给出21世纪的某个截止年份。

//输出格式:
//逐行输出满足条件的所有闰年年份，即每个年份占一行。输入若非21世纪的年份则输出"Invalid year!"。若不存在任何闰年，则输出“None”。

//输入样例1:
//2048

#include <stdio.h>
int main()
{
	int y, c = 0;
	scanf("%d", &y);
	if (y <= 2000 || y > 2100) {
		printf("Invalid year!");
		return 0;
	}
	for (int i = 2001; i <= y; i++)
	{
		if (i % 4 == 0 && i % 100 != 0) {
			printf("%d\n", i);
			c++;
		}
	}
	if (c == 0) printf("None");
	return 0;
}